Revit 2027 API
View.ShadowIntensity Property
 The intesity of cast shadows - 0 = no shadows, 100 = black.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ShadowIntensity { get; set; }
Public Property ShadowIntensity As Integer
	Get
	Set
public:
property int ShadowIntensity {
	int get ();
	void set (int value);
}
member ShadowIntensity : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The value is invalid. The valid range is 0 through 100
InvalidOperationException |  When setting this property: This view does not contain display-related properties.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace